//2.双关系递推数列
//设集合M定义如下:
//(1)  1∈M  
//(2)  x∈M => 2x+1∈M, 5x-1∈M
//(3)  再无其它的数属于M。
//试求将集合M元素从小到大排列所得序列的第n（n<10000）项与前n项之和。


#include <stdio.h>

int main() {
    long n, p2, p5, i, s, m[10000];

    printf("  请输入n：");
    scanf("%ld", &n);

    m[1] = 1;
    s = 1;
    p2 = 1;
    p5 = 1;  // 排头p2,p5赋初值

//    for (i = 2; i <= n; i++) {
//        if (2 * m[p2] + 1 < 5 * m[p5] - 1) {
//            m[i] = 2 * m[p2] + 1;
//            p2++;
//        } else {
//            m[i] = 5 * m[p5] - 1;
//            if (2 * m[p2] + 1 == 5 * m[p5] - 1) {
//                p2++;  // 为避免重复项，P2须增1
//            }
//            p5++;
//        }
//        s += m[i];  // 实现求和
//    }
	for(int i = 2; i <= n; i++)
	{
		if(2 * m[p2] + 1 < 5 * m[p5] - 1)
		{
			m[i] = 2 * m[p2] + 1;
			p2++;
		}else{
			m[i] = 5 * m[p5] - 1;
			if(2 * m[p2] + 1 == 5 * m[p5] - 1){
				p2++;
			}
			p5++;
			
		}
		s += m[i];
	}

    printf(" m(%ld)=%ld,s=%ld\n", n, m[n], s);
    return 0;
}
